In [ ]:
# python example from http://www.gregreda.com/2013/10/26/working-with-pandas-dataframes/

#The City of Chicago is kind enough to publish all city employee salaries to its open data portal. 
#Let's go through some basic groupby examples using this data.

In [ ]:
#Since the data contains a dollar sign for each salary, python will treat the field as a series of strings. 
#We can use the converters parameter to change this when reading in the file.

In [44]:
import pandas as pd
headers = ['name', 'title', 'department', 'salary']
chicago = pd.read_csv('Jupyter/chicago/city-of-chicago-salaries.csv',
                      header=0,
                      names=headers,
                      converters={'salary': lambda x: float(x.replace('$',''))}
                      )
chicago.head()

                    name                     title        department   salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0

In [45]:
#pandas groupby returns a DataFrameGroupBy object which has a variety of methods, 
#many of which are similar to standard SQL aggregate functions.

In [65]:
by_dept = chicago.groupby('department')
print(by_dept)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021916057488>

In [66]:
#Calling count returns the total number of NOT NULL values within each column.
#If we were interested in the total number of records in each group, we could use size.

In [71]:
print(by_dept.count().head()) # NOT NULL records within each column
print('\n')
print(by_dept.size().tail())

                   name  title  salary  dept_rank
department
ADMIN HEARNG         42     42      42         42
ANIMAL CONTRL        61     61      61         61
AVIATION           1218   1218    1218       1218
BOARD OF ELECTION   110    110     110        110
BOARD OF ETHICS       9      9       9          9


department
PUBLIC LIBRARY     926
STREETS & SAN     2070
TRANSPORTN        1168
TREASURER           25
WATER MGMNT       1857
dtype: int64

In [69]:
# Summation can be done via sum. averaging by mean, etc.

In [50]:
print(by_dept.sum()[20:25]) # total salaries of each depertment
print('\n')
print(by_dept.mean()[20:25]) # average salary of each depertment

                       salary
department
HUMAN RESOURCES     4850928.0
INSPECTOR GEN       4035150.0
IPRA                7006128.0
LAW                31883920.2
LICENSE APPL COMM     65436.0


                         salary
department
HUMAN RESOURCES    71337.176471
INSPECTOR GEN      80703.000000
IPRA               82425.035294
LAW                70853.156000
LICENSE APPL COMM  65436.000000

In [51]:
# Operations can also be done on an individual Series within a grouped object.
# Say we were curious about the five departments with the most distinct titles - the pandas equivalent to:

SELECT department, COUNT(DISTINCT title)
FROM chicago
GROUP BY department
ORDER BY 2 DESC
LIMIT 5;

In [52]:
print(by_dept['title'].unique())
print('\n')
print(by_dept['title'].nunique().sort_values(ascending=False)[:5])

department
ADMIN HEARNG             [STAFF ASSISTANT - EXCLUDED, ADMINISTRATIVE AS...
ANIMAL CONTRL            [ANIMAL CARE AIDE I, ANIMAL CONTROL OFFICER, E...
AVIATION                 [ELECTRICAL MECHANIC, AVIATION SECURITY OFFICE...
BOARD OF ELECTION        [SENIOR CLERK-ELECTIONS, PRINCIPAL CLERK-ELECT...
BOARD OF ETHICS          [EXECUTIVE DIR - BOARD OF ETHICS, STAFF ASST, ...
BUDGET & MGMT            [DIR OF PUBLIC INFORMATION, SENIOR BUDGET ANAL...
BUILDINGS                [PLUMBING INSPECTOR, VENTILATION AND FURNACE I...
BUSINESS AFFAIRS         [ENGINEERING TECHNICIAN V, SENIOR PUBLIC INFOR...
CITY CLERK               [EDITORIAL ASST, ASST MANAGING EDITOR COUNCIL ...
CITY COUNCIL             [LEGISLATIVE AIDE, ASST TO THE ALDERMAN, ALDER...
COMMUNITY DEVELOPMENT    [ACCOUNTING TECHNICIAN II, SENIOR RESEARCH ANA...
CULTURAL AFFAIRS         [SPECIAL EVENTS COORD III, STUDENT INTERN, ASS...
DISABILITIES             [DEPUTY COMMISSIONER, DISABILITY SPECIALIST II...
DoIT                     [SENIOR TELECOMMUNICATIONS SPECIALIST, DIR OF ...
FAMILY & SUPPORT         [FOSTER GRANDPARENT, SENIOR PROGRAMMER/ANALYST...
FINANCE                  [BOOTER - PARKING, ACCOUNTING TECHNICIAN I, AC...
FIRE                     [FIREFIGHTER, FIREFIGHTER (PER ARBITRATORS AWA...
GENERAL SERVICES         [CHIEF CONTRACT EXPEDITER, ELECTRICAL MECHANIC...
HEALTH                   [PERSONAL COMPUTER OPERATOR II, SENIOR ENVIRON...
HUMAN RELATIONS          [ASST TO THE COMMISSIONER, HUMAN RELATIONS SPE...
HUMAN RESOURCES          [TESTING ADMINISTRATOR, CLERK III, ASSOC CLASS...
INSPECTOR GEN            [INVESTIGATOR III - IG, ASST TO THE EXEC DIR, ...
IPRA                     [INVESTIGATOR - IPRA II, SUPERVISING INVESTIGA...
LAW                      [ASST CORPORATION COUNSEL SUPVSR, ASST CORPORA...
LICENSE APPL COMM                                             [STAFF ASST]
MAYOR'S OFFICE           [ASST ADMINISTRATIVE SECRETARY I, ASST PRESS S...
OEMC                     [TRAFFIC CONTROL AIDE-HOURLY, SUPERVISING TRAF...
POLICE                   [POLICE OFFICER, CLERK III, CROSSING GUARD, PO...
POLICE BOARD             [SUPERVISING CLERK, EXECUTIVE DIR - POLICE BOARD]
PROCUREMENT              [MANAGER OF CERTIFICATION / COMPLIANCE, CERTIF...
PUBLIC LIBRARY           [LIBRARY ASSOCIATE, LIBRARY PAGE, LIBRARIAN IV...
STREETS & SAN            [MOTOR TRUCK DRIVER, SANITATION LABORER, TREE ...
TRANSPORTN               [TRAFFIC SIGNAL REPAIRMAN, ASPHALT LABORER, MO...
TREASURER                [ASST CITY TREASURER, DEPUTY CITY TREASURER, A...
WATER MGMNT              [WATER RATE TAKER, CIVIL ENGINEER IV, ENGINEER...
Name: title, dtype: object


department
WATER MGMNT    153
TRANSPORTN     150
POLICE         130
AVIATION       125
HEALTH         118
Name: title, dtype: int64

split-apply-combine
The real power of groupby comes from it's split-apply-combine ability.

What if we wanted to see the highest paid employee within each department. Given our current dataset, we'd have to do something like this in SQL:

SELECT *
FROM chicago c
INNER JOIN (
    SELECT department, max(salary) max_salary
    FROM chicago
    GROUP BY department
) m
ON c.department = m.department
AND c.salary = m.max_salary;

This would give you the highest paid person in each department, but it would return multiple if there were many equally high paid people within a department.

Alternatively, you could alter the table, add a column, and then write an update statement to populate that column. However, that's not always an option.

Note: This would be a lot easier in PostgreSQL, T-SQL, and possibly Oracle due to the existence of partition/window/analytic functions. I've chosen to use MySQL syntax throughout this tutorial because of it's popularity. Unfortunately, MySQL doesn't have similar functions.

Using groupby we can define a function (which we'll call ranker) that will label each record from 1 to N, where N is the number of employees within the department. We can then call apply to, well, apply that function to each group (in this case, each department).

In [77]:
def ranker(df):
    """Assigns a rank to each employee based on salary, with 1 being the highest paid.
    Assumes the data is DESC sorted."""
    df['dept_rank'] = np.arange(len(df)) + 1
    return df

In [78]:
chicago.sort_values('salary', ascending=False, inplace=True)
chicago = chicago.groupby('department').apply(ranker)
print(chicago[chicago.dept_rank == 1].head(7))

                         name                     title      department  \
18039     MC CARTHY,  GARRY F  SUPERINTENDENT OF POLICE          POLICE
8004           EMANUEL,  RAHM                     MAYOR  MAYOR'S OFFICE
25588       SANTIAGO,  JOSE A         FIRE COMMISSIONER            FIRE
763    ANDOLINO,  ROSEMARIE S  COMMISSIONER OF AVIATION        AVIATION
4697     CHOUCAIR,  BECHARA N    COMMISSIONER OF HEALTH          HEALTH
21971      PATTON,  STEPHEN R       CORPORATION COUNSEL             LAW
12635      HOLT,  ALEXANDRA D                BUDGET DIR   BUDGET & MGMT

         salary  dept_rank
18039  260004.0          1
8004   216210.0          1
25588  202728.0          1
763    186576.0          1
4697   177156.0          1
21971  173664.0          1
12635  169992.0          1

In [79]:
chicago[chicago.department == "LAW"][:5]

,name,title,department,salary,dept_rank
21971,"PATTON, STEPHEN R",CORPORATION COUNSEL,LAW,173664.0,1
6311,"DARLING, LESLIE M",FIRST ASST CORPORATION COUNSEL,LAW,149160.0,2
17680,"MARTINICO, JOSEPH P",CHIEF LABOR NEGOTIATOR,LAW,144036.0,3
22357,"PETERS, LYNDA A",CITY PROSECUTOR,LAW,139932.0,4
25022,"RUETHER, MARY E",DEPUTY CORPORATION COUNSEL,LAW,137076.0,5

       d  c  b  a
three  0  3  2  1
one    4  7  6  5